PEMEC_structured_mesh_channel_different_skeleton_hydrophobicity/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    wall_solid
    {
        type            wall;
        inGroups        1(wall);
        nFaces          49108;
        startFace       986517;
    }
    top_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          13294;
        startFace       1035625;
    }
    side_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          26784;
        startFace       1048919;
    }
    inlet_1
    {
        type            patch;
        nFaces          830;
        startFace       1075703;
    }
    outlet
    {
        type            patch;
        nFaces          818;
        startFace       1076533;
    }
    inlet_2
    {
        type            patch;
        nFaces          1414;
        startFace       1077351;
    }
    bottom_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12614;
        startFace       1078765;
    }
)

// ************************************************************************* //
