PEMEC_structured_mesh_channel_different_skeleton_hydrophobicity/baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{

    inlet_1
    {
    type     fixedValue;
    value    uniform (0.02 0 0);
    }

    inlet_2
    {
    type fixedValue;
    value uniform (0 0.002 0);
    }

    outlet
    {
        type           zeroGradient;
    }

    bottom_wall
    {
        type            noSlip;
    }

    top_wall
    {
        type            noSlip;
    }

    side_walls
    {
        type            noSlip;
    }
    
    wall_solid
    {
        type            noSlip;
    }
}
// ************************************************************************* //
