PEMEC_structured_mesh_channel_different_skeleton_hydrophobicity/baseCase/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;

method scotch;
